code-review/NRB_3471_3546/База_Стало/DataProcessors/ФормированиеРаскрытияСпискаВладельцев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеРаскрытияСпискаВладельцев</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьККаталогу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДЕПО_ПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗагрузкиСписковРаскрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗагрузкиСписковРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьККаталогуISO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуISO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьISOИзФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеРаскрытияСпискаВладельцев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>REPORT_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийДокументДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийДокументНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага1Остаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага2Остаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйВидКД1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйРеференсКД1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйВидКД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйРеференсКД2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКорпоративногоДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДРеференс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведенияСобрания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСобрания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РСВ_ТипСобрания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассСобрания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РСВ_КлассСобрания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаскрытия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РСВ_ТипСписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступленияЗапроса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеИдФайлам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>REPORT_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяАрхива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОшибкаОбработки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>(Общ) Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>(Общ) Номер лицевого счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНазначенияБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦельОткрытияСчета0420409</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ФормированиеРаскрытияСпискаВладельцев/Ext/ObjectModule.bsl
//***********************************************************************************************
// Работа с ISO файлами
//***********************************************************************************************

Функция СоздатьТаблицуДляЦБ()
	//----
	ТаблицаПоЦБ	= Новый ТаблицаЗначений;
	//----
	ТаблицаПоЦБ.Колонки.Добавить("FaceAmnt");
	ТаблицаПоЦБ.Колонки.Добавить("Unit");
	ТаблицаПоЦБ.Колонки.Добавить("BalTp");
	ТаблицаПоЦБ.Колонки.Добавить("Dt");
	ТаблицаПоЦБ.Колонки.Добавить("SfkpgPlc");
	//----
	Возврат ТаблицаПоЦБ;
КонецФункции

Функция ПолучитьДанныеИзФайла(ПолныйПутьФайла)
	ТекстXML	= Новый ТекстовыйДокумент;
	ТекстXML.Прочитать(ПолныйПутьФайла);
	XMLДанные	= ТекстXML.ПолучитьТекст();
	
	ТипXDTO		= ФабрикаXDTO.Пакеты.Получить("MeetingNotification_ISO20022BMET").КорневыеСвойства.Получить("MeetingNotification").Тип;
	
	XMLДанные	= СтрЗаменить(XMLДанные, "<MeetingNotification>", "<MeetingNotification xmlns=""MeetingNotification_ISO20022BMET"">");
	
	ЧтениеXML 	= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLДанные);
	
	Объект		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
	
	AppHdr		= Объект.AppHdr;
	Document	= Объект.Document;
	// Параметры документа раскрытия
	ПараметрыРаскрытия	= Новый Соответствие;
	// Параметры уведомления
	ПараметрыРаскрытия.Вставить("НомерВходящего"		, AppHdr.BizMsgIdr);
	ПараметрыРаскрытия.Вставить("ДатаВходящего"			, AppHdr.CreDt);
	ПараметрыРаскрытия.Вставить("РеференсКД"			, Document.MtgNtfctn.Mtg.MtgId);
	ПараметрыРаскрытия.Вставить("ТипСобрания"			, Document.MtgNtfctn.Mtg.TP);
	Если Не Document.MtgNtfctn.Mtg.Clssfctn = Неопределено Тогда
		Если Не Document.MtgNtfctn.Mtg.Clssfctn.Cd = Неопределено Тогда
			ПараметрыРаскрытия.Вставить("КлассСобрания"			, Document.MtgNtfctn.Mtg.Clssfctn.Cd);
		КонецЕсли;
	КонецЕсли;	
	ПараметрыРаскрытия.Вставить("ДатаПроведенияСобрания", Дата(1,1,1));
	ПараметрыРаскрытия.Вставить("ДатаОкончания"			, Дата(1,1,1));
	ПараметрыРаскрытия.Вставить("Комментарий"			, "");
	Если Не Document.MtgNtfctn.Vote = Неопределено Тогда
		Если Не Document.MtgNtfctn.Vote.VoteDdln = Неопределено Тогда
			Если Не Document.MtgNtfctn.Vote.VoteDdln.Dt = Неопределено Тогда
				ПараметрыРаскрытия.Вставить("ДатаОкончания"	, Document.MtgNtfctn.Vote.VoteDdln.Dt);
			КонецЕсли;
		КонецЕсли;
		ПараметрыРаскрытия.Вставить("Комментарий"	, Document.MtgNtfctn.Vote.AddtlVtngRqrmnts);
	КонецЕсли;
	// Даты проведения собрания
	ДатаПроведенияСобрания	= Новый Массив;
	Если не Document.MtgNtfctn.MtgDtls = Неопределено Тогда
		Для Каждого ЗаписьСхемыXDTO ИЗ Document.MtgNtfctn.MtgDtls Цикл
			Если НЕ ЗаписьСхемыXDTO.DtAndTm.Dt = Неопределено Тогда
				ДатаПроведенияСобрания	= ЗаписьСхемыXDTO.DtAndTm.Dt;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	ПараметрыРаскрытия.Вставить("ДатаПроведенияСобрания", ДатаПроведенияСобрания);
	// Информация о ЦБ
	МассивИнформацииОЦБ		= Новый Массив;
	Если Не Document.MtgNtfctn.Scty = Неопределено Тогда
		Для Каждого ЗаписьСхемыXDTO ИЗ Document.MtgNtfctn.Scty Цикл
			ПараметрыЦБ	= Новый Соответствие;
			ПараметрыЦБ.Вставить("ISIN"		, ЗаписьСхемыXDTO.Id.Id.ISIN);
			ПараметрыЦБ.Вставить("Desc"		, ЗаписьСхемыXDTO.Id.Desc);
			ПараметрыЦБ.Вставить("КодНРД"	, Лев(ЗаписьСхемыXDTO.Id.Desc, Найти(ЗаписьСхемыXDTO.Id.Desc, "#")-1));
			// Выделяем номер гос регистрации
			ОстатокСтроки	= Сред(ЗаписьСхемыXDTO.Id.Desc, Найти(ЗаписьСхемыXDTO.Id.Desc, "#")+1);
			ОстатокСтроки	= Сред(ОстатокСтроки, Найти(ОстатокСтроки, "#")+1);
			ГосРегНомер		= Лев(ОстатокСтроки, Найти(ОстатокСтроки, "#")-1);
			// Установим номер гос. регистрации
			ПараметрыЦБ.Вставить("ГосРегНомер"	, ГосРегНомер);
			// Получим данные по ЦБ на счетах ДЕПО
			ПараметрыЦБНаСчетах	= Новый Соответствие;
			Если Не ЗаписьСхемыXDTO.Pos = Неопределено Тогда
				Для Каждого ЗаписьPOSСхемыXDTO ИЗ ЗаписьСхемыXDTO.Pos Цикл
					//---
					ТаблицаПоЦБ	= СоздатьТаблицуДляЦБ();
					//---
					ПараметрыЦБНаСчетах.Вставить("НомерСчетаДепо", ЗаписьPOSСхемыXDTO.AcctId);
					// Создадим структуру данных о количестве
					Для Каждого ЗаписьHldgBalСхемыXDTO ИЗ ЗаписьPOSСхемыXDTO.HldgBal Цикл
						НовСтр	= ТаблицаПоЦБ.Добавить();
						НовСтр.FaceAmnt	= ЗаписьHldgBalСхемыXDTO.Bal.FaceAmt;
						НовСтр.Unit		= ЗаписьHldgBalСхемыXDTO.Bal.Unit;
						НовСтр.BalTp	= ЗаписьHldgBalСхемыXDTO.BalTp;
						НовСтр.Dt		= ЗаписьHldgBalСхемыXDTO.Dt;
						НовСтр.SfkpgPlc	= ЗаписьHldgBalСхемыXDTO.SfkpgPlc;
					КонецЦикла;	
					ПараметрыЦБНаСчетах.Вставить("ДанныеПоСчету", ТаблицаПоЦБ);
				КонецЦикла;
			КонецЕсли;
			ПараметрыЦБ.Вставить("ПараметрыЦБНаСчетах", ПараметрыЦБНаСчетах);
			МассивИнформацииОЦБ.Добавить(ПараметрыЦБ);
		КонецЦикла;
	КонецЕсли;
	//---
	ПараметрыРаскрытия.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ);
	//---
	Если МассивИнформацииОЦБ.Количество()=0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПараметрыРаскрытия;
	КонецЕсли;
КонецФункции

Процедура ОбработатьДанныеИЗФайлаISO(ДанныеФайла, ФайлZIP)
	//---
	Если ДанныеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Создание строки по раскрытию
	НоваяСтрока	= ДанныеРаскрытияСпискаВладельцев.Добавить();
	//---
	НоваяСтрока.Обрабатывать				= Истина;
	НоваяСтрока.Организация					= Константы.ОрганизацияПоУмолчанию.Получить();
	НоваяСтрока.Инициатор					= Константы.МестоХраненияПоУмолчанию.Получить();
	НоваяСтрока.ВходящийДокументДата		= ДанныеФайла.Получить("ДатаВходящего");
	НоваяСтрока.ВходящийДокументНомер		= ДанныеФайла.Получить("НомерВходящего");
	НоваяСтрока.КДРеференс					= ДанныеФайла.Получить("РеференсКД");
	НоваяСтрока.ДатаОкончанияПриема			= ДанныеФайла.Получить("ДатаОкончания");
	НоваяСтрока.Комментарий					= ДанныеФайла.Получить("Комментарий");
	//---
	Если Не ЗагрузитьISOИзФайла Тогда
		Если Не СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива") = Неопределено Тогда
			НоваяСтрока.REPORT_ID	= СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").REPORT_ID;
		Иначе
			ВызватьИсключение "Не удалось определить 'REPORT_ID'!!! - по входящему №"+НоваяСтрока.ВходящийДокументНомер+" от: "+НоваяСтрока.ВходящийДокументДата;
		КонецЕсли;		
	Иначе
		НоваяСтрока.REPORT_ID	= НоваяСтрока.ВходящийДокументНомер;
	КонецЕсли;
	// Определим есть ли в 1С уже существующий документ
	НоваяСтрока.ДокументРаскрытия	= ПолучитьРаскрытиеСпискаВладельцев(НоваяСтрока.REPORT_ID);
	// Определим вид КД
	КодТипСобрания		= СокрЛП(ДанныеФайла.Получить("ТипСобрания"));
	ТипСобрания			= Справочники.РСВ_ТипСобрания.НайтиПоКоду(КодТипСобрания);
	Если Не ЗначениеЗаполнено(ТипСобрания) И ЗначениеЗаполнено(КодТипСобрания) Тогда
		ТипСобранияОбъект				= Справочники.РСВ_ТипСобрания.СоздатьЭлемент();
		ТипСобранияОбъект.Код			= КодТипСобрания;
		ТипСобранияОбъект.Наименование	= КодТипСобрания;
		ТипСобранияОбъект.Записать();
		//---
		ТипСобрания	= ТипСобранияОбъект.Ссылка;						
	КонецЕсли;
	НоваяСтрока.ТипСобрания	= ТипСобрания;
	//---
	КодКлассСобрания	= СокрЛП(ДанныеФайла.Получить("КлассСобрания"));
	Если Не КодКлассСобрания = Неопределено Тогда
		КлассСобрания		= Справочники.РСВ_КлассСобрания.НайтиПоКоду(КодКлассСобрания);
		Если Не ЗначениеЗаполнено(КлассСобрания) И ЗначениеЗаполнено(КодКлассСобрания) Тогда
			КлассСобранияОбъект					= Справочники.РСВ_КлассСобрания.СоздатьЭлемент();
			КлассСобранияОбъект.Код				= КодКлассСобрания;
			КлассСобранияОбъект.Наименование	= КодКлассСобрания;
			КлассСобранияОбъект.Записать();
			//---
			КлассСобрания	= КлассСобранияОбъект.Ссылка;						
		КонецЕсли;
		НоваяСтрока.КлассСобрания	= КлассСобрания;
	КонецЕсли;
	//----
	Если КодТипСобрания = "GMET" Тогда
		Если КодКлассСобрания = "AMET" ИЛИ КодКлассСобрания = Неопределено Тогда
			ВидКДКод	= "MEET";
		Иначе
			ВидКДКод	= "BMET";
		КонецЕсли;
	Иначе
		ВидКДКод	= "XMET";
	КонецЕсли;
	//---
	ВидКД		= Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(ВидКДКод);
	Если Не ЗначениеЗаполнено(ВидКД) И ЗначениеЗаполнено(ВидКДКод) Тогда
		ВидКДОбъект				= Справочники.ВидыКорпоративныхДействий.СоздатьЭлемент();
		ВидКДОбъект.Код			= ВидКДКод;
		ВидКДОбъект.Наименование= ВидКДКод;
		ВидКДОбъект.Записать();
		//---
		ВидКД	= ВидКДОбъект.Ссылка;						
	КонецЕсли;
	НоваяСтрока.ВидКорпоративногоДействия	= ВидКД;
	// Обработаем даты проведения собраний
	НоваяСтрока.ДатаПроведенияСобрания	= ДанныеФайла.Получить("ДатаПроведенияСобрания");
	// Обработаем данные по ЦБ и заполним на основании их поля таблицы
	МассивИнформацииЦБ	= ДанныеФайла.Получить("МассивИнформацииОЦБ");
	//---
	Для Каждого ИнформацияЦБ ИЗ МассивИнформацииЦБ Цикл
		ЦеннаяБумага		= ПолучитьЦеннуюБумагуПоКодуНРД(СокрЛП(ИнформацияЦБ.Получить("КодНРД")));
		//---
		НомерСчетаДепо		= ИнформацияЦБ.Получить("ПараметрыЦБНаСчетах").Получить("НомерСчетаДепо");
		Если Не НомерСчетаДепо = Неопределено Тогда
			НайденныйСчетДЕПО		= Справочники.СчетаДепоМХ.НайтиПоКоду(СокрЛП(НомерСчетаДепо));
			Если Не ЗначениеЗаполнено(НайденныйСчетДЕПО) Тогда
				НоваяСтрока.СчетДЕПО	= СчетДЕПО_ПоУмолчанию;
			Иначе
				НоваяСтрока.СчетДЕПО	= НайденныйСчетДЕПО;
			КонецЕсли;
		КонецЕсли;
		//---
		ДанныеПоСчету		= ИнформацияЦБ.Получить("ПараметрыЦБНаСчетах").Получить("ДанныеПоСчету");
		Если Не ДанныеПоСчету = Неопределено Тогда
			Если ДанныеПоСчету.Количество()>0 Тогда
				КоличествоЦБ	= ДанныеПоСчету[0].Unit;
				ДатаФиксации	= ДанныеПоСчету[0].Dt;
			Иначе
				КоличествоЦБ	= 0;
				ДатаФиксации	= Дата(1,1,1);
			КонецЕсли;
		Иначе
			КоличествоЦБ	= 0;
			ДатаФиксации	= Дата(1,1,1);
		КонецЕсли;
		//---
		НоваяСтрока.ДатаФиксации	= ДатаФиксации;
		//---
		Если Не ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) Тогда
			НоваяСтрока.Эмитент					= ЦеннаяБумага.Эмитент;
			НоваяСтрока.ЦеннаяБумага1			= ЦеннаяБумага;
			НоваяСтрока.ЦеннаяБумага1Остаток	= КоличествоЦБ;
		Иначе
			Если НоваяСтрока.ЦеннаяБумага1.Эмитент <> ЦеннаяБумага.Эмитент Тогда
				ВызватьИсключение "При формирова списка 'Раскрытие списка владельцев' - по входящему №"+НоваяСтрока.ВходящийДокументНомер+" от: "+НоваяСтрока.ВходящийДокументДата+" - определены ЦБ с разными 'Эмитентами'";
			КонецЕсли;
			НоваяСтрока.ЦеннаяБумага2			= ЦеннаяБумага;
			НоваяСтрока.ЦеннаяБумага2Остаток	= КоличествоЦБ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьISOФайл(ПутьККаталогуОбработки, ФайлZIP = Неопределено) Экспорт
	Если ЗагрузитьISOИзФайла Тогда
		ПолныйПутьФайла	= ПутьККаталогуОбработки;
	Иначе
		ПолныйПутьФайла	= ПутьККаталогуОбработки+"\repxml.xml";
	КонецЕсли;
	ДанныеФайла	= ПолучитьДанныеИзФайла(ПолныйПутьФайла);
	ОбработатьДанныеИЗФайлаISO(ДанныеФайла, ФайлZIP);
КонецПроцедуры

//***********************************************************************************************
// Работа с ЛУЧом получение файлов и запись на диск перед обработкой
//***********************************************************************************************

Функция ПолучитьТекстЗапросаSQL()
	Возврат
	"/****** Сценарий для команды SelectTopNRows среды SSMS  ******/
	|SELECT
	|  d.[doc_num]
	|  ,vr.[doc_id]
	|  ,vr.[maker_code]
	|  ,vr.[order_doc_id]
	|  ,vr.[order_reg_date_sgd]
	|  ,vr.[order_reg_no]
	|  ,vr.[order_reg_no_sgd]
	|  ,vr.[order_t_id]
	|  ,vr.[order_t_n]
	|  ,vr.[out_form]
	|  ,vr.[person_code]
	|  ,vr.[reciv_code]
	|  ,vr.[reference]
	|  ,vr.[report_id]
	|  ,vr.[sec_code]
	|  ,vr.[file_name]
	|  ,vr.[archived]
	|  ,vr.[move_hdd]
	|  ,vr.[file_body]
	|  ,vr.[file_body_arh]
	|  ,ol.[ADD_INFO]
	|FROM
	|	[NDC].[dbo].[v_reports]		as vr
	|
	|INNER JOIN
	|	[NDC].[dbo].[documents ]	AS d
	|ON
	|	vr.doc_id = d.doc_id
	|
	|LEFT JOIN
	|	[NDC].[dbo].[ol_advice]		AS ol
	|ON
	|	vr.doc_id = ol.doc_id
	|
	|WHERE
	|	vr.[order_t_id] = '61'
	|AND
	|	d.[doc_type] = 'OLADVICE'
	|AND
	|	d.[doc_date] BETWEEN {ts '"+Формат(ПериодНачало, "ДФ=yyyy-MM-dd")+" 00:00:00'} AND {ts '"+Формат(ПериодКонец, "ДФ=yyyy-MM-dd")+" 23:59:59'}";
КонецФункции

Процедура ЗаписатьЗначениеSQLВоВременныйФайл(doc_num, Значение, ИмяВременногоФайла, ADD_INFO = "")
	Stream = Неопределено;
	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	
	SaveOptionsEnum	= Новый Структура("adSaveCreateNotExist, adSaveCreateOverWrite",1 , 2);
	
	Stream.Write(Значение);
	Попытка	
		Stream.SaveToFile(ИмяВременногоФайла, SaveOptionsEnum.adSaveCreateOverWrite);
		НоваяЗапись	= СоответствиеИдФайлам.Добавить();
		НоваяЗапись.REPORT_ID	= СокрЛП(doc_num);
		НоваяЗапись.ИмяАрхива	= ИмяВременногоФайла;
		НоваяЗапись.Комментарий	= ADD_INFO;
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ПолучитьФайлыИзЛуча(ПутьККаталогу) Экспорт
	//---
	Перем Соединение;
	Перем Команда;
	Перем RS;
	// Получим параметры источника данных
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевPartad);
	Если Не ЗначениеЗаполнено(ПутьККаталогу) Тогда
		ПутьККаталогу	= Параметры.Папка;
	КонецЕсли; 	
	//---	
	ВнешниеДанные.ADOConnect(Соединение, Команда, RS, ПланыВидовХарактеристик.ВнешниеИсточники.Луч, 30, 30);
	//---
	ТекстSQLЗапроса = ПолучитьТекстЗапросаSQL();
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.Луч);
	Команда.CommandText = СтрЗаменить(ТекстSQLЗапроса, "[NDC].", ?(ПустаяСтрока(Параметры.База), "", "["+СокрЛП(Параметры.База)+"]."));
	//---
	rs = Команда.Execute();
	//---
	Пока Не rs.Eof() Цикл
		ЗаписатьЗначениеSQLВоВременныйФайл(rs.Fields("doc_num").Value, rs.Fields("file_body").Value,
			ПутьККаталогу+"\"+rs.Fields("file_name").Value, rs.Fields("ADD_INFO").Value);
		rs.MoveNext();
	КонецЦикла;
	//---
	ВнешниеДанные.ADODisconnect(Соединение, Команда, RS);
КонецПроцедуры

Функция ПолучитьТекстЗапросаISO_SQL()
	Возврат
	"/****** Сценарий для команды SelectTopNRows среды SSMS  ******/
	|SELECT
	|  d.[doc_num]
	|  ,vr.[doc_id]
	|  ,vr.[maker_code]
	|  ,vr.[order_doc_id]
	|  ,vr.[order_reg_date_sgd]
	|  ,vr.[order_reg_no]
	|  ,vr.[order_reg_no_sgd]
	|  ,vr.[order_t_id]
	|  ,vr.[order_t_n]
	|  ,vr.[out_form]
	|  ,vr.[person_code]
	|  ,vr.[reciv_code]
	|  ,vr.[reference]
	|  ,vr.[report_id]
	|  ,vr.[sec_code]
	|  ,vr.[file_name]
	|  ,vr.[archived]
	|  ,vr.[move_hdd]
	|  ,vr.[file_body]
	|  ,vr.[file_body_arh]
	|FROM
	|	[NDC].[dbo].[v_reports]		as vr
	|INNER JOIN
	|	[NDC].[dbo].[documents ]	AS d
	|ON
	|	vr.doc_id = d.doc_id
	|WHERE
	|	vr.[order_t_id] = '67'
	|AND
	|	d.[doc_type] = 'REPORT'
	|AND
	|	vr.[out_form] = 'CA012'
	|AND
	|	d.[doc_date] BETWEEN {ts '"+Формат(ПериодНачало, "ДФ=yyyy-MM-dd")+" 00:00:00'} AND {ts '"+Формат(ПериодКонец, "ДФ=yyyy-MM-dd")+" 23:59:59'}";
КонецФункции

Процедура ПолучитьФайлыIsoИзЛуча(ПутьККаталогуISO) Экспорт
	//---
	Перем Соединение;
	Перем Команда;
	Перем RS;
	// Получим параметры источника данных
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевISO);
	Если Не ЗначениеЗаполнено(ПутьККаталогуISO) Тогда
		ПутьККаталогуISO	= Параметры.Папка;
	КонецЕсли; 	
	//---	
	ВнешниеДанные.ADOConnect(Соединение, Команда, RS, ПланыВидовХарактеристик.ВнешниеИсточники.Луч, 30, 30);
	//---
	ТекстSQLЗапроса = ПолучитьТекстЗапросаISO_SQL();
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.Луч);
	Команда.CommandText = СтрЗаменить(ТекстSQLЗапроса, "[NDC].", ?(ПустаяСтрока(Параметры.База), "", "["+СокрЛП(Параметры.База)+"]."));
	rs					= Команда.Execute();
	//---
	Пока Не rs.Eof() Цикл
		ЗаписатьЗначениеSQLВоВременныйФайл(rs.Fields("doc_num").Value, rs.Fields("file_body").Value,
			ПутьККаталогуISO+"\"+rs.Fields("file_name").Value);
		rs.MoveNext();
	КонецЦикла;
	//---
	ВнешниеДанные.ADODisconnect(Соединение, Команда, RS);
КонецПроцедуры

//***********************************************************************************************
// Работа с DBFами
//***********************************************************************************************

Функция ВернутьТип1СПоТипуDBF(ТипBF)
	// Содержит тип поля: "S"- строка, "N" - число, "D" - дата, "L" - булево, "F" - число, "M" - мемо поле (не поддерживается).
	Тип1С	= Неопределено;
	//---
	Если ТипBF = "S" Тогда
		Тип1С	= Новый ОписаниеТипов("Строка");
	ИначеЕсли ТипBF = "N" Тогда
		Тип1С	= Новый ОписаниеТипов("Число");
	ИначеЕсли ТипBF = "D" Тогда
		Тип1С	= Новый ОписаниеТипов("Дата");
	ИначеЕсли ТипBF = "L" Тогда
		Тип1С	= Новый ОписаниеТипов("Булево");
	ИначеЕсли ТипBF = "F" Тогда
		Тип1С	= Новый ОписаниеТипов("Число");
	КонецЕсли;
	
	Возврат Тип1С;
КонецФункции

Функция СоздатьТаблицуПоDBF(xBase, Имя)
	Таблица			= Новый ТаблицаЗначений;
	КоличествоПолей	= xBase.Поля.Количество();
	
	Для сч = 0 По КоличествоПолей-1 Цикл
		ТипКолонки	= ВернутьТип1СПоТипуDBF(xBase.Поля[сч].Тип);
		Если НЕ ТипКолонки = Неопределено Тогда
			Таблица.Колонки.Добавить(xBase.Поля[сч].Имя, ТипКолонки);
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("В таблице DBF '"+Имя+"' присутствуют поля 'MEMO' типа, которые не обрабатываются средствами 1С!");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции

Функция ОбработатьDBFФайлы(ПутьКВременномуКаталогу) Экспорт
	//---
	ФайлыДляОбработки	= НайтиФайлы(ПутьКВременномуКаталогу, "*.dbf");
	xBase				= Новый XBase;
	xBase.Кодировка		= КодировкаXBase.ANSI;
	ТаблицыИКлючи		= Новый Соответствие;
	//---
	Для Каждого ФайлИзМассива ИЗ ФайлыДляОбработки Цикл
		Если СтрДлина(ФайлИзМассива.ИмяБезРасширения) > 8 Тогда
			Продолжить;    // не прошли ограничение 8.3 для имени файла
		КонецЕсли;
		xBase.ОткрытьФайл(ФайлИзМассива.ПолноеИмя, , Истина);
		//---
		Таблица	= СоздатьТаблицуПоDBF(xBase, ФайлИзМассива.Имя);
		//---
		Если xBase.Первая() Тогда
			Пока Истина Цикл
				НоваяСтрока	= Таблица.Добавить();
				//---
				Для Каждого Колонка ИЗ Таблица.Колонки Цикл
					НоваяСтрока[Колонка.Имя]	= xBase[Колонка.Имя];
				КонецЦикла;				
				//---
				Если Не xBase.Следующая() Тогда
					Прервать;
				КонецЕсли;
				//---
			КонецЦикла;
		КонецЕсли;
		//---
		xBase.ЗакрытьФайл();
		//---
		ТаблицыИКлючи.Вставить(ФайлИзМассива.ИмяБезРасширения, Таблица);
		//---
	КонецЦикла;
	//---
	Возврат ТаблицыИКлючи;
КонецФункции

//***********************************************************************************************
// Работа с ZIP архивами сохраненными из ЛУЧа
//***********************************************************************************************

Процедура ОбработатьZIPФайлы(Удалять = Истина) Экспорт
	Если ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD Тогда
		ПутьККаталогуОбработки	= ПутьККаталогу;
	Иначе
		ПутьККаталогуОбработки	= ПутьККаталогуISO;
	КонецЕсли;
	// Инициируем переменную (булево) где будем отслеживать наличие ошибок во время загрузки
	ОперацияУспешна	= Истина;
	// Получим параметры источника данных
	Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевPartad);
	Если Не ЗначениеЗаполнено(ПутьККаталогуОбработки) Тогда
		ПутьККаталогуОбработки	= Параметры.Папка;
	КонецЕсли; 	
	
	ФайлыZipДляОбработки		= НайтиФайлы(ПутьККаталогуОбработки, "*.zip");
	СписокФайловZIPДляОбработки = Новый Массив;
	
	Для Каждого ФайлZIP ИЗ ФайлыZipДляОбработки Цикл
		// Формируем список файлов для переноса в локальную папку временных фалов перед обработкой
		СписокФайловДляОбработки = Новый Массив;		
		СписокФайловДляОбработки.Добавить(ФайлZIP.Имя);
		
		СписокФайловZIPДляОбработки.Добавить(ФайлZIP.Имя);
		
		ОписаниеОшибки					= "";
		УдалятьКаталогФайловПриОшибке	= Ложь;
		
		ПапкаСФайлами					= РаботаСФайлами.СоздатьВременныйКаталог(ОписаниеОшибки);
		УдалятьКаталогФайловПриОшибке	= Истина;
		
		Если ПапкаСФайлами = Неопределено Тогда
			#Если Клиент Тогда
				Предупреждение(ОписаниеОшибки);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Ошибка,
					, , ОписаниеОшибки);
			#КонецЕсли
			СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
		 	Возврат;
		КонецЕсли; 
		
		ОперацияУспешна = РаботаСФайлами.УдалитьФайлыВУказаннойПапке(ПапкаСФайлами, СписокФайловДляОбработки, ОписаниеОшибки);
		
		Если Не ОперацияУспешна Тогда
			#Если Клиент Тогда
				Предупреждение(ОписаниеОшибки);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Ошибка,
					, , ОписаниеОшибки);
			#КонецЕсли
			
			Если УдалятьКаталогФайловПриОшибке Тогда
				РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
			КонецЕсли;	
			
			СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
		 	Возврат;
		КонецЕсли; 
		
		ОперацияУспешна = РаботаСФайлами.СкопироватьФайлыВЛокальныйTEMP(ПутьККаталогуОбработки,
			СписокФайловДляОбработки, ПапкаСФайлами, ОписаниеОшибки);
		
		Если Не ОперацияУспешна Тогда
			#Если Клиент Тогда
				Предупреждение(ОписаниеОшибки);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Ошибка,
					, , ОписаниеОшибки);
			#КонецЕсли
			
			Если УдалятьКаталогФайловПриОшибке Тогда
				РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
			КонецЕсли;	
			
			СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
		 	Возврат;
		КонецЕсли; 
		
		// Распаковываем скопированный архив и обрабатываем нужные файлы
		Попытка
			АрхивZIP	= Новый ЧтениеZipФайла(ПапкаСФайлами+"\"+ФайлZIP.Имя);
			АрхивZIP.ИзвлечьВсе(ПапкаСФайлами, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			// Обходим список файлов архива и дополняем список файлов которые потом будем очищать
			АрхивZIPЭлементы	= АрхивZIP.Элементы;
			Для сч = 0 По АрхивZIPЭлементы.Количество()-1 Цикл
				СписокФайловДляОбработки.Добавить(АрхивZIPЭлементы.Получить(сч).Имя);
			КонецЦикла; 
			АрхивZIP.Закрыть();
		Исключение
			ОперацияУспешна = Ложь;
		КонецПопытки;
		
		Если Не ОперацияУспешна Тогда
			#Если Клиент Тогда
				Предупреждение(ОписаниеОшибки);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Ошибка,
					, , ОписаниеОшибки);
			#КонецЕсли
			
			РаботаСФайлами.УдалитьФайлыВУказаннойПапке(ПапкаСФайлами, СписокФайловДляОбработки, ОписаниеОшибки);
			
			Если УдалятьКаталогФайловПриОшибке Тогда
				РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
			КонецЕсли;	
			
			СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
			Возврат;
		КонецЕсли; 
		
		Если ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD Тогда
			ТаблицыИКлючи = ОбработатьDBFФайлы(ПапкаСФайлами);
			Попытка
				ОбработатьДанныеИЗФайла(ТаблицыИКлючи, ФайлZIP);
			Исключение
				СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
				ОперацияУспешна = Ложь;
			КонецПопытки;
		Иначе
			Попытка
				ОбработатьISOФайл(ПапкаСФайлами, ФайлZIP);
			Исключение
				СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
				ОперацияУспешна = Ложь;
			КонецПопытки;
		КонецЕсли;
		
		// Загрузка закончена удалим файлы из временного каталога
		ОперацияУспешна = РаботаСФайлами.УдалитьФайлыВУказаннойПапке(ПапкаСФайлами, СписокФайловДляОбработки, ОписаниеОшибки);
		Если Удалять Тогда
			// Удалим архивы скаченные из ЛУЧа
			ОперацияУспешна = РаботаСФайлами.УдалитьФайлыВУказаннойПапке(ПутьККаталогуОбработки+"\",
				СписокФайловZIPДляОбработки, ОписаниеОшибки);
		КонецЕсли;
		
		Если УдалятьКаталогФайловПриОшибке Тогда
			ОперацияУспешна = РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
		КонецЕсли;	
		
		Если Не ОперацияУспешна Тогда
			#Если Клиент Тогда
				Предупреждение(ОписаниеОшибки);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			#КонецЕсли
			
			Если УдалятьКаталогФайловПриОшибке Тогда
				РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
			КонецЕсли;	
			
			СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива").ОшибкаОбработки	= Истина; 
		 	Возврат;
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

//***********************************************************************************************
// Работа с данными
//***********************************************************************************************

Процедура ОчиститьОбъектРаскрытиеСпискаВладельцев(Объект)
	//---
	МетаданныеОбъекта	= Объект.Метаданные();
	//---
	Для Каждого Реквизит ИЗ МетаданныеОбъекта.Реквизиты Цикл
		Объект[Реквизит.Имя] = "";
	КонецЦикла;
	//---
	Для Каждого ТабличнаяЧасть ИЗ МетаданныеОбъекта.ТабличныеЧасти Цикл
		Объект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРаскрытиеСпискаВладельцев(REPORT_ID);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И REPORT_ID = &REPORT_ID
	|	И ТипЗагрузкиСписковРаскрытия = &ТипЗагрузкиСписковРаскрытия");

	Запрос.УстановитьПараметр("REPORT_ID"					, REPORT_ID);
	Запрос.УстановитьПараметр("ТипЗагрузкиСписковРаскрытия"	, ТипЗагрузкиСписковРаскрытия);
	
	Результат = Запрос.Выполнить().Выгрузить();	
	
	Если Результат.Количество()=0 Тогда
		Возврат Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка();
	Иначе
		Возврат Результат[0].Ссылка;
	КонецЕсли;
КонецФункции

Функция ПолучитьЦеннуюБумагуПоКодуНРД(КодНРД)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
    |	КодыЗагрузки.Владелец КАК ЦБ
    |ИЗ
    |	Справочник.КодыЗагрузки КАК КодыЗагрузки
    |ГДЕ
    |	НЕ	КодыЗагрузки.ПометкаУдаления
    |	И	КодыЗагрузки.Биржа = &НДЦ
    |	И	КодыЗагрузки.Код = &Код");
	
	Запрос.УстановитьПараметр("Код", КодНРД);
	Запрос.УстановитьПараметр("НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	
	Результат = Запрос.Выполнить().Выгрузить();

	Если Результат.Количество()=0 Тогда
		ВызватьИсключение "При загрузке 'Раскрытия списков владельцев' не удалось определить ценную бумагу по коду загрузки - "+КодНРД;
	Иначе
		Возврат Результат[0].ЦБ;
	КонецЕсли;	
КонецФункции

Функция ЗагрузитьВалютуИзКлассификатора(Код)
	Если Код = "" Тогда
		Возврат Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;
	
	Макет = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют");
	ТекущаяОбласть = Макет.НайтиТекст(Код);
	
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат Справочники.Валюты.ПустаяСсылка();
	КонецЕсли; 
	
	ОбластьКодЧисловой         = Макет.Области.КодЧисловой;
	ОбластьНаименованиеКраткое = Макет.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное  = Макет.Области.НаименованиеПолное;
	
	КодЧисловой         = Макет.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	НаименованиеКраткое = Макет.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное  = Макет.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное. Право).Текст;
	
	// Создание новой валюты.
	Элемент = Справочники.Валюты.СоздатьЭлемент();
	Элемент.Код                = КодЧисловой;
	Элемент.Наименование       = НаименованиеКраткое;
	Элемент.НаименованиеПолное = НаименованиеПолное;
	Элемент.Записать();
	Возврат Элемент.Ссылка;
КонецФункции

Функция ПолучитьБанковскийСчет(Организация, Валюта)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
	|	И БанковскиеСчета.ТипНазначения = &ТипНазначения
	|	И БанковскиеСчета.Владелец = &Организация
	|	И (БанковскиеСчета.ДатаЗакрытия > &ТекущаяДата
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");

	Запрос.УстановитьПараметр("Организация"				, Организация);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств"	, Валюта);
	Запрос.УстановитьПараметр("ТипНазначения"			, ?(Валюта = Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.ТипыНазначенияБанковскихСчетов.Депозитарный, Перечисления.ТипыНазначенияБанковскихСчетов.ДепозитарныйТранзит));
	Запрос.УстановитьПараметр("ТекущаяДата"				, ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		Возврат Результат[0].Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Процедура ОбработатьДанныеИЗФайла(ТаблицыИКлючи, ФайлZIP)
	// Получим ссылки на таблицы
	reporth	= ТаблицыИКлючи.Получить("reporth");
	crprests= ТаблицыИКлючи.Получить("crprests");
	crpsecur= ТаблицыИКлючи.Получить("crpsecur");
	crpdetl	= ТаблицыИКлючи.Получить("crpdetl");
	loadreg	= ТаблицыИКлючи.Получить("loadreg");
	//----
	Если reporth = Неопределено ИЛИ crprests = Неопределено ИЛИ crpsecur = Неопределено ИЛИ crpdetl = Неопределено ИЛИ loadreg = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//----
	Если Не reporth = Неопределено Тогда
		//---
		ДатаУведомления			= reporth[0].REG_DATE;
		ВремяУведомления		= СокрЛП(reporth[0].TREG_DATE);
		// Если дата уведомления не входит в период, то пропускаем
		Если Дата(Формат(ДатаУведомления, "ДФ=yyyyMMdd"))<НачалоДня(ПериодНачало) Тогда
			Возврат;
		КонецЕсли;
		// Создание строки по раскрытию
		НоваяСтрока	= ДанныеРаскрытияСпискаВладельцев.Добавить();
		//---
		НоваяСтрока.Обрабатывать			= Истина;
		//---
		НоваяСтрока.Организация				= Константы.ОрганизацияПоУмолчанию.Получить();
		НоваяСтрока.Инициатор				= Константы.МестоХраненияПоУмолчанию.Получить();
		НоваяСтрока.ВходящийДокументДата	= Дата(Формат(ДатаУведомления, "ДФ=yyyyMMdd")+СтрЗаменить(ВремяУведомления, ":", ""));
		НоваяСтрока.ВходящийДокументНомер	= СокрЛП(reporth[0].REG_NO);
		//---
		СтрокаТЧСоответствиеИдФайлам = СоответствиеИдФайлам.Найти(ФайлZIP.ПолноеИмя, "ИмяАрхива");
		Если НЕ СтрокаТЧСоответствиеИдФайлам = Неопределено Тогда
			НоваяСтрока.REPORT_ID	= СтрокаТЧСоответствиеИдФайлам.REPORT_ID;
			НоваяСтрока.Комментарий	= СтрокаТЧСоответствиеИдФайлам.Комментарий;
		Иначе
			ВызватьИсключение "Не удалось определить 'REPORT_ID' по входящему №"
				+ НоваяСтрока.ВходящийДокументНомер + " от: " + НоваяСтрока.ВходящийДокументДата;
		КонецЕсли;		
		
		НоваяСтрока.ДатаПоступленияЗапроса = reporth[0].REG_DATE;
		// Определим есть ли в 1С уже существующий документ
		НоваяСтрока.ДокументРаскрытия	= ПолучитьРаскрытиеСпискаВладельцев(НоваяСтрока.REPORT_ID);
		//---
		Если Не crprests = Неопределено Тогда 
			Если crprests.Количество()>0 Тогда
				НайденныйСчетДЕПО		= Справочники.СчетаДепоМХ.НайтиПоКоду(СокрЛП(crprests[0].DEPO_ACC_C));
				Если Не ЗначениеЗаполнено(НайденныйСчетДЕПО) Тогда
					НоваяСтрока.СчетДЕПО	= СчетДЕПО_ПоУмолчанию;
				Иначе
					НоваяСтрока.СчетДЕПО	= НайденныйСчетДЕПО;
				КонецЕсли;
			КонецЕсли;
			Для Каждого Строка ИЗ crprests Цикл
				Если Не ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) Тогда
					НоваяСтрока.ЦеннаяБумага1			= ПолучитьЦеннуюБумагуПоКодуНРД(СокрЛП(Строка.SECURITY_C));
					НоваяСтрока.ЦеннаяБумага1Остаток	= Строка.REST;
				Иначе
					НоваяСтрока.ЦеннаяБумага2			= ПолучитьЦеннуюБумагуПоКодуНРД(СокрЛП(Строка.SECURITY_C));
					НоваяСтрока.ЦеннаяБумага2Остаток	= Строка.REST;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//---
		НоваяСтрока.Эмитент	= НоваяСтрока.ЦеннаяБумага1.Эмитент;
		Если ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) И ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага2) Тогда
			Если НоваяСтрока.ЦеннаяБумага1.Эмитент <> НоваяСтрока.ЦеннаяБумага2.Эмитент Тогда
				ВызватьИсключение "При формирова списка 'Раскрытие списка владельцев' - по входящему №"+НоваяСтрока.ВходящийДокументНомер+" от: "+НоваяСтрока.ВходящийДокументДата+" - определены ЦБ с разными 'Эмитентами'";
			КонецЕсли;
		КонецЕсли;		
        //---
		Если Не crpdetl = Неопределено Тогда
			Если crpdetl.Количество()>0 Тогда
				Для Каждого Строка ИЗ crpdetl Цикл
					ВидСвязанногоКдКод	= СокрЛП(Строка.CA_TYP_LN);
					ВидСвязанногоКдИмя	= СокрЛП(Строка.CA_NAM_LN);
					//---
					ВидСвязанногоКД		= Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(ВидСвязанногоКдКод);
					Если Не ЗначениеЗаполнено(ВидСвязанногоКД) И ЗначениеЗаполнено(ВидСвязанногоКдКод) Тогда
						ВидСвязанногоКДОбъект				= Справочники.ВидыКорпоративныхДействий.СоздатьЭлемент();
						ВидСвязанногоКДОбъект.Код			= ВидСвязанногоКдКод;
						ВидСвязанногоКДОбъект.Наименование	= ВидСвязанногоКдИмя;
						ВидСвязанногоКДОбъект.Записать();
						//---
						ВидСвязанногоКД	= ВидСвязанногоКДОбъект.Ссылка;						
					КонецЕсли;
					//---
					СвязанныйРеференсКД	= СокрЛП(Строка.CA_REF_LN);
					Если ЗначениеЗаполнено(ВидСвязанногоКдКод) И ЗначениеЗаполнено(СвязанныйРеференсКД) Тогда
						Если Не ЗначениеЗаполнено(НоваяСтрока.СвязанныйРеференсКД1) Тогда
							НоваяСтрока.СвязанныйВидКД1		= ВидСвязанногоКД;
							НоваяСтрока.СвязанныйРеференсКД1= СвязанныйРеференсКД;
						Иначе
							НоваяСтрока.СвязанныйВидКД2		= ВидСвязанногоКД;
							НоваяСтрока.СвязанныйРеференсКД2= СвязанныйРеференсКД;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		//---
		Если Не loadreg = Неопределено Тогда
			Если loadreg.Количество()>0 Тогда
				ВалютаРаскрытия	= СокрЛП(loadreg[0].CURRENCY_C);
				ВидКДКод		= СокрЛП(loadreg[0].C_T_CODE);
				ВидКДИмя		= СокрЛП(loadreg[0].C_T_NAME);
				ТипСпискаКод	= СокрЛП(loadreg[0].R_D_CODE);
				//---
				ВидКД		= Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(ВидКДКод);
				Если Не ЗначениеЗаполнено(ВидКД) И ЗначениеЗаполнено(ВидКДКод) Тогда
					ВидКДОбъект				= Справочники.ВидыКорпоративныхДействий.СоздатьЭлемент();
					ВидКДОбъект.Код			= ВидКДКод;
					ВидКДОбъект.Наименование= ВидКДИмя;
					ВидКДОбъект.Записать();
					//---
					ВидКД	= ВидКДОбъект.Ссылка;						
				КонецЕсли;
				//---
				НоваяСтрока.ВидКорпоративногоДействия	= ВидКД;
				НоваяСтрока.КДРеференс					= СокрЛП(loadreg[0].REFERENCE);
				НоваяСтрока.ДатаФиксации				= loadreg[0].FIXING_DAT;
				НоваяСтрока.ДатаОкончанияПриема			= Дата(Формат(loadreg[0].FINISH_DAT, "ДФ=yyyyMMdd")+СтрЗаменить(loadreg[0].TFINISH_DA, ":", "")); 
				//---
				
				КодировкаNDC = Константы.КодировкаNDC.Получить();
				Если НЕ ЗначениеЗаполнено(КодировкаNDC) Тогда
					ВызватьИсключение "Константа Кодировка NDC не заполнена! Дальнейшая работа обработки невозможна.";
				КонецЕсли; 
				ОснованиеЗапросаПредварительно = СокрЛП(loadreg[0].BASE_ON);
				ОснованиеЗапроса = СтроковыеФункцииКлиентСервер.ИзменитьКодировкуСтроки(ОснованиеЗапросаПредварительно, КодировкаNDC);
				НоваяСтрока.ОснованиеЗапроса = ОснованиеЗапроса;
				
				Если ЗначениеЗаполнено(ВалютаРаскрытия) Тогда
					Валюта	= Справочники.Валюты.НайтиПоНаименованию(?(ВалютаРаскрытия="RUB", "SUR", ВалютаРаскрытия));
					Если Не ЗначениеЗаполнено(Валюта) Тогда
						Валюта	= ЗагрузитьВалютуИзКлассификатора(?(ВалютаРаскрытия="RUB", "SUR", ВалютаРаскрытия));
					КонецЕсли;
				Иначе
					Валюта	= НоваяСтрока.ЦеннаяБумага1.ВалютаНоминала;
				КонецЕсли;
				//---
				НоваяСтрока.БанковскийСчет	= ПолучитьБанковскийСчет(НоваяСтрока.Организация, Валюта);
				//---
				ТипСписка	= Справочники.РСВ_ТипСписка.НайтиПоКоду(ТипСпискаКод);
				Если Не ЗначениеЗаполнено(ТипСписка) И ЗначениеЗаполнено(ТипСпискаКод) Тогда
					ТипСпискаОбъект				= Справочники.РСВ_ТипСписка.СоздатьЭлемент();
					ТипСпискаОбъект.Код			= ВидКДКод;
					ТипСпискаОбъект.Записать();
					//---
					ТипСписка	= ТипСпискаОбъект.Ссылка;						
				КонецЕсли;
				НоваяСтрока.ТипСписка	= ТипСписка;
				//---
			КонецЕсли;
		КонецЕсли;
		//---
	КонецЕсли;	
КонецПроцедуры

//***********************************************************************************************
// Формирование документов
//***********************************************************************************************

Процедура СформироватьДокументы() Экспорт
	Для Каждого Строка ИЗ ДанныеРаскрытияСпискаВладельцев Цикл
		//---
		Если Не Строка.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		//---
		Если ЗначениеЗаполнено(Строка.ДокументРаскрытия) Тогда
			РаскрытиеСписка	= Строка.ДокументРаскрытия.ПолучитьОбъект();
			ОчиститьОбъектРаскрытиеСпискаВладельцев(РаскрытиеСписка);
		Иначе
			РаскрытиеСписка	= Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
		КонецЕсли;
		//---
		ЗаполнитьЗначенияСвойств(РаскрытиеСписка, Строка);
		//---
		РаскрытиеСписка.Дата						= ТекущаяДата();
		РаскрытиеСписка.Автор						= ПараметрыСеанса.ТекущийПользователь;
		РаскрытиеСписка.ТипЗагрузкиСписковРаскрытия	= ТипЗагрузкиСписковРаскрытия;
		РаскрытиеСписка.ВыгрузкаPARTADВCоответствииCоCтатьей8_6_1 = (Найти(РаскрытиеСписка.Комментарий, "8.6-1") > 0);
		//---
		Если ЗначениеЗаполнено(РаскрытиеСписка.СвязанныйРеференсКД1) Тогда
			РаскрытиеСписка.КарточкаКД 					= Документы.КорпоративноеДействие_Новый.КорпоративноеДействиеПоРеференсу(РаскрытиеСписка.СвязанныйРеференсКД1);
		КонецЕсли;
		ОписаниеОшибки	= "";
		НовыйДок		= РаскрытиеСписка.ЭтоНовый();
		РаскрытиеСписка.Записать();
		Если НовыйДок Тогда
			#Если Клиент Тогда
				Сообщить("Создан документ - " + РаскрытиеСписка.Ссылка);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Информация, , , "Создан документ - " + РаскрытиеСписка.Ссылка);
			#КонецЕсли
		Иначе
			#Если Клиент Тогда
				Сообщить("Изменен документ - " + РаскрытиеСписка.Ссылка);
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'", УровеньЖурналаРегистрации.Информация, , , "Изменен документ - " + РаскрытиеСписка.Ссылка);
			#КонецЕсли
		КонецЕсли;
		//---
		Строка.Обрабатывать	= Ложь;
		//---
		Строка.ДокументРаскрытия	= РаскрытиеСписка.Ссылка;
		
		Если ЗначениеЗаполнено(РаскрытиеСписка.КарточкаКД) Тогда
			ЗарегистрироватьЭтапКД(РаскрытиеСписка.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАГРУЗКИ PARTAD ИЗ ШЛЮЗА 


Процедура НайтиФайлыДляЗагрузкиЗаПериод(СоответствиеФайловДляЗагрузки, ПутьДляПоиска) Экспорт
	
	ПапкаСФайламиTEMP 	= РаботаСФайлами.СоздатьВременныйКаталог();
	
	НайденнныеКаталоги	= Новый Массив;
	ПолучитьКаталогиРаскрытияЗаПериодОбработки(ПутьДляПоиска, НайденнныеКаталоги);
	
	Для каждого ИмяКаталога из НайденнныеКаталоги Цикл
		НайденныеФайлы = НайтиФайлы(ИмяКаталога.ПолноеИмя, "*.zip", Истина);
		Для каждого ФайлZIP из НайденныеФайлы Цикл
			ОбнаруженНеобходимыйФайлReporth = Ложь;
			Попытка
				АрхивZIP	= Новый ЧтениеZipФайла(ФайлZIP.ПолноеИмя);
				АрхивZIP.ИзвлечьВсе(ПапкаСФайламиTEMP, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
				АрхивZIPЭлементы	= АрхивZIP.Элементы;
				Для сч = 0 По АрхивZIPЭлементы.Количество()-1 Цикл
					ИмяDBFФайла = АрхивZIPЭлементы.Получить(сч).Имя;
					Если ИмяDBFФайла = "reporth.dbf" Тогда
						ОбнаруженНеобходимыйФайлReporth = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла; 
				АрхивZIP.Закрыть();
				Если ОбнаруженНеобходимыйФайлReporth Тогда
					ТаблицыИКлючи = ОбработатьDBFФайлы(ПапкаСФайламиTEMP);
					reporth	= ТаблицыИКлючи.Получить("reporth");
					Если reporth.Количество() > 0 Тогда
						OrderType = СокрЛП(reporth[0].ORD_TYPE_I);
						REPORT_ID = Формат(reporth[0].REPORT_ID, "ЧГ=0");
						Если OrderType = "61" Тогда
							НоваяЗапись	= СоответствиеИдФайлам.Добавить();
							НоваяЗапись.REPORT_ID	= REPORT_ID;
							НоваяЗапись.ИмяАрхива	= ФайлZIP.ПолноеИмя;
							СоответствиеФайловДляЗагрузки.Вставить(ФайлZIP.Имя, ФайлZIP.Путь);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'",
											УровеньЖурналаРегистрации.Ошибка,,, 
											ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьКаталогиРаскрытияЗаПериодОбработки(Путь, НайденнныеКаталоги)
	
	Сутки = ОбщегоНазначенияПовтИсп.СекундВСутках();
	
	ДатаАнализа = НачалоДня(ПериодНачало);
	Пока ДатаАнализа <= ПериодКонец Цикл
		МаскаКаталога = МаскаКаталогаСФайламиРаскрытияТекущегоДня(ДатаАнализа);
		НайденнныеКаталогиПоМаске = НайтиФайлы(Путь, МаскаКаталога, Истина);
		Для каждого НайденныйКаталог из НайденнныеКаталогиПоМаске Цикл
			Если НайденныйКаталог.ЭтоКаталог() Тогда
				НайденнныеКаталоги.Добавить(НайденныйКаталог);
			КонецЕсли;
		КонецЦикла;
		ДатаАнализа = ДатаАнализа + Сутки;
	КонецЦикла;

КонецПроцедуры

Функция МаскаКаталогаСФайламиРаскрытияТекущегоДня(ДатаАнализа)
	ПредставлениеДня = "" + День(ДатаАнализа) + ПредставлениеМесяца(Месяц(ДатаАнализа));
	Возврат "Z" + ПредставлениеДня + "*" + ".CRY";
КонецФункции

Функция ПредставлениеМесяца(НомерМесяца)
	Если НомерМесяца <= 9 Тогда 
		Возврат НомерМесяца;
	ИначеЕсли НомерМесяца = 10 Тогда
		Возврат "A";
	ИначеЕсли НомерМесяца = 11 Тогда
		Возврат "B";
	ИначеЕсли НомерМесяца = 12 Тогда
		Возврат "C";
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции
 
Процедура ПеренестиФайлыРаскрытияВАрхив(КаталогЗагрузки, ПутьККаталогуОбработки) Экспорт 
	
	ПолныйПутьАрхива = ПутьККаталогуОбработки + "\Archive";
	ФайлАрхив = Новый Файл(ПолныйПутьАрхива); 
	Если НЕ ФайлАрхив.Существует()Тогда 
		СоздатьКаталог(ПолныйПутьАрхива);
	КонецЕсли;
	
	ПолныйПутьInbox = ПутьККаталогуОбработки + "\inbox"; 
	ИмяКаталогаZ = СтрЗаменить(КаталогЗагрузки, ПолныйПутьInbox + "\", "");
	ПозицияВАдресе = Найти(ИмяКаталогаZ, "\");
	Если ПозицияВАдресе > 0 Тогда 
		ИмяКаталогаZ = Лев(ИмяКаталогаZ, ПозицияВАдресе - 1);
	КонецЕсли;
	
	КаталогиВInbox = НайтиФайлы(ПолныйПутьInbox + "\" + ИмяКаталогаZ);
	
	Для каждого КаталогZ из КаталогиВInbox Цикл
		КаталогАрхива = ПолныйПутьАрхива + "\" + ИмяКаталогаZ;
		СоздатьКаталог(КаталогАрхива);
		КлонироватьСтруктуруКаталоговВНовойПапке(КаталогZ, КаталогАрхива);
		ПеренестиФайлыВСтруктуреКаталогов(КаталогZ, КаталогАрхива);
		Попытка
			УдалитьФайлы(КаталогZ.ПолноеИмя);  
		Исключение
			ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'",
			УровеньЖурналаРегистрации.Ошибка,,, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;  
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиФайлыВСтруктуреКаталогов(ИсходныйКаталог, ИмяНовогоКаталога)
	Файлы = НайтиФайлы(ИсходныйКаталог.ПолноеИмя, "*.*");
	Для Каждого Файл ИЗ Файлы Цикл
		Если Файл.ЭтоФайл() Тогда
			ПереместитьФайл(Файл.ПолноеИмя, ИмяНовогоКаталога + "\" + Файл.Имя);
		ИначеЕсли Файл.ЭтоКаталог() Тогда
			ПеренестиФайлыВСтруктуреКаталогов(Файл, ИмяНовогоКаталога + "\" + Файл.Имя)
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
	
Процедура КлонироватьСтруктуруКаталоговВНовойПапке(ИсходныйКаталог, ИмяНовогоКаталога)
	Каталоги = НайтиФайлы(ИсходныйКаталог.ПолноеИмя, "*.*");
	Для Каждого Каталог ИЗ Каталоги Цикл
		Если Каталог.ЭтоКаталог() Тогда
			ИмяВложенногоКаталога = ИмяНовогоКаталога + "\" + Каталог.Имя;
			СоздатьКаталог(ИмяВложенногоКаталога);
			КлонироватьСтруктуруКаталоговВНовойПапке(Каталог, ИмяВложенногоКаталога);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
Процедура ЗарегистрироватьЭтапКД(ДокументСсылка)
	
	Этап 			= Справочники.ЭтапыКД.ЗапросСпискаВФорматеPARTAD;
	ТипУведомления 	= "NEWM";
		
	ТипУведомления = Справочники.ТипыУведомления.НайтиПоКоду(ТипУведомления);
	Если Этап.Пустая() Тогда
		ЗаписьЖурналаРегистрации("Загрузка 'Раскрытия списка владельцев'",
					УровеньЖурналаРегистрации.Ошибка,,ДокументСсылка,
					"Не найден тип уведомления " + ТипУведомления + ". Этап КД не выполнен");
		Возврат;
	КонецЕсли;
	
	ЗаписьЭтапаКД = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
	ЗаписьЭтапаКД.КД 				= ДокументСсылка.КарточкаКД;
	ЗаписьЭтапаКД.ДокументКД 		= ДокументСсылка;
	ЗаписьЭтапаКД.Активность 		= Истина;
	ЗаписьЭтапаКД.Период 			= ДокументСсылка.Дата;
	ЗаписьЭтапаКД.ЭтапКД 			= Этап;
	ЗаписьЭтапаКД.КодОтчета 		= Этап.Код;
	ЗаписьЭтапаКД.НомерСообщения 	= СокрЛП(ДокументСсылка.Номер);
	ЗаписьЭтапаКД.ТипУведомления	= ТипУведомления;
	ЗаписьЭтапаКД.Исходящее			= Ложь;
	ЗаписьЭтапаКД.Записать();
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
